/*
    Напишите программу, которая считывает два целых числа и
    выводит их частное.
*/

#include <iostream>
using namespace std;

int main() {
    int a, b = 0;
    cin >> a >> b;
    cout << a / b;
}