/*
    Напишите программу, которая считывает два double-числа
    и выводит их частное.
*/

#include <iostream>
using namespace std;

int main() {
    double a, b;
    cin >> a >> b;
    cout << a / b;
}